Tekla.Structures.Dialog.UIControls.LoadingForm
The LoadingForm class creates a dialog that is shown while something is
being loaded by the main window and that needs the process to finish.

Tekla.Structures.Dialog.UIControls.LoadingForm.#ctor
Creates a new instance of the form.

Tekla.Structures.Dialog.UIControls.LoadingForm.OnClosing(System.ComponentModel.CancelEventArgs)
Prevents the loading dialog from being closed.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.LoadingForm.OnLoad(System.EventArgs)
Localizes the control when loaded.
Exc: The event arguments.

Tekla.Structures.Dialog.UIControls.LoadingForm.AllowClosing
Allows the closing of the dialog. By default disabled.

Tekla.Structures.Dialog.UIControls.LoadingForm.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.LoadingForm.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.LoadingForm.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.